In [1]:
import pandas as pd

In [3]:
tables = pd.read_html("https://www.basketball-reference.com/")

In [4]:
len(tables)

21

In [10]:
tables[5]

  Unnamed: 0   1   2   3   4
0        UTA  20  21  22  27
1        ATL  19  23  32  30

#####